/* 主角血量 */
export const RoleBlood = 10;
/* 通关血量 */
export const BossBlood = -10;
/* 卡片组合 */
export const CardsSequence: number[][] = [
  [1, 1, 1, 2, 2, 2, 2, 3, 3, 1, 2, -1, -1, -2, -2, -3, -4, -3],
  [1, 1, 2, 2, 2, 3, 1, 1, 2, 3, 3, -1, -2, -3, -2, -1, -4, -3],
  [1, 1, 2, 2, 3, 3, 1, 2, 3, -1, -2, -2, -3, -3, -4, -4, -1, -1],
  [1, 1, 2, 2, 3, 3, 2, 1, -1, -1, -2, -2, -3, -1, -4, -4, -3, -1],
];

// 精力不足，无法消除
export const TipsMap = [
  {
    val: 1,
    tip: "抽根香烟，精力 +1",
  },
  {
    val: 2,
    tip: "喝杯咖啡，精力 +2",
  },
  {
    val: 3,
    tip: "吃碗泡面，精力 +3",
  },
  {
    val: -1,
    tip: "处理工作邮件，精力 -1",
  },
  {
    val: -2,
    tip: "处理工作电话，精力 -2",
  },
  {
    val: -3,
    tip: "老板问候，精力 -3",
  },
  {
    val: -4,
    tip: "傻逼甲方，精力 -4",
  },
];
